# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
   [[-1, 1, Conv, [64, 7, 2]],
   [-1, 1, nn.MaxPool2d, [3, 2]],
   [-1, 1, RenextBottleNeckBlock, [256, 1,32]],
   [-1, 2, RenextBottleNeckBlock, [256, 1,32]], #3
   
   [-1, 1, RenextBottleNeckBlock, [512, 2,32]],
   [-1, 3, RenextBottleNeckBlock, [512, 1,32]], #5
   
   [-1, 1, RenextBottleNeckBlock, [1024, 2,32]],
   [-1, 5, RenextBottleNeckBlock, [1024, 1,32]], #7
   
   [-1, 1, RenextBottleNeckBlock, [2048, 2,32]],
   [-1, 2, RenextBottleNeckBlock, [2048, 1,32]]] #9 

# YOLOv5 v6.0 head
head:
   [[-1, 1, Conv, [1024, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [1024, False]],  # 13

   [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [512, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [1024, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [1024, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [2048, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
